Masmiseim36/nxpSDK/devices/MIMXRT798S/periph/PERI_RTC.h
#define RTC_WAKE_TIMER_CTRL_INTR_EN_MASK         (0x20U)
#define RTC_WAKE_TIMER_CTRL_INTR_EN_SHIFT        (5U)
/*! INTR_EN - Interrupt Enable
 *  0b0..Disable
 *  0b1..Enable
 */
#define RTC_WAKE_TIMER_CTRL_INTR_EN(x)           (((uint32_t)(((uint32_t)(x)) << RTC_WAKE_TIMER_CTRL_INTR_EN_SHIFT)) & RTC_WAKE_TIMER_CTRL_INTR_EN_MASK)

#define RTC_WAKE_TIMER_CTRL_LOFRQCLK_SRC_EN_MASK (0x10000000U)
#define RTC_WAKE_TIMER_CTRL_LOFRQCLK_SRC_EN_SHIFT (28U)
/*! LOFRQCLK_SRC_EN - Low Frequency Clock Source Enable
 *  0b0..Disable
 *  0b1..Enable
 */
#define RTC_WAKE_TIMER_CTRL_LOFRQCLK_SRC_EN(x)   (((uint32_t)(((uint32_t)(x)) << RTC_WAKE_TIMER_CTRL_LOFRQCLK_SRC_EN_SHIFT)) & RTC_WAKE_TIMER_CTRL_LOFRQCLK_SRC_EN_MASK)

#define RTC_WAKE_TIMER_CTRL_SHUTOFF_OSC32_MASK   (0x80000000U)
#define RTC_WAKE_TIMER_CTRL_SHUTOFF_OSC32_SHIFT  (31U)
/*! SHUTOFF_OSC32 - Shut off OSC32KNP
 *  0b0..Enable
 *  0b1..Disable
 */
#define RTC_WAKE_TIMER_CTRL_SHUTOFF_OSC32(x)     (((uint32_t)(((uint32_t)(x)) << RTC_WAKE_TIMER_CTRL_SHUTOFF_OSC32_SHIFT)) & RTC_WAKE_TIMER_CTRL_SHUTOFF_OSC32_MASK)
/*! @} */

/*! @name WAKE_TIMER_CNT - Wake Timer 0 Counter (CPU0) */
/*! @{ */

#define RTC_WAKE_TIMER_CNT_WAKE_CNT_MASK         (0xFFFFFFFFU)
#define RTC_WAKE_TIMER_CNT_WAKE_CNT_SHIFT        (0U)
/*! WAKE_CNT - Wake Counter 1 Value */
#define RTC_WAKE_TIMER_CNT_WAKE_CNT(x)           (((uint32_t)(((uint32_t)(x)) << RTC_WAKE_TIMER_CNT_WAKE_CNT_SHIFT)) & RTC_WAKE_TIMER_CNT_WAKE_CNT_MASK)
/*! @} */

/*! @name GPR - General Purpose */
/*! @{ */

#define RTC_GPR_DATA_MASK                        (0xFFFFFFFFU)
#define RTC_GPR_DATA_SHIFT                       (0U)
/*! DATA - Data */
#define RTC_GPR_DATA(x)                          (((uint32_t)(((uint32_t)(x)) << RTC_GPR_DATA_SHIFT)) & RTC_GPR_DATA_MASK)
/*! @} */


/*!
 * @}
 */ /* end of group RTC_Register_Masks */


/*!
 * @}
 */ /* end of group RTC_Peripheral_Access_Layer */


/*
** End of section using anonymous unions
*/

#if defined(__ARMCC_VERSION)
  #if (__ARMCC_VERSION >= 6010050)
    #pragma clang diagnostic pop
  #else
    #pragma pop
  #endif
#elif defined(__GNUC__)
  /* leave anonymous unions enabled */
#elif defined(__IAR_SYSTEMS_ICC__)
  #pragma language=default
#elif defined(__XTENSA__)
  /* leave anonymous unions enabled */
#else
  #error Not supported compiler type
#endif

/*!
 * @}
 */ /* end of group Peripheral_access_layer */


#endif  /* PERI_RTC_H_ */

